RT-Thread/rt-thread/bsp/Infineon/libraries/IFX_PSOC6_HAL/mtb-pdl-cat1/devices/COMPONENT_CAT1B/include/ip/cyip_mxs40adcmic.h
/***************************************************************************//**
* \file cyip_mxs40adcmic.h
*
* \brief
* MXS40ADCMIC IP definitions
*
********************************************************************************
* \copyright
* (c) (2016-2021), Cypress Semiconductor Corporation (an Infineon company) or
* an affiliate of Cypress Semiconductor Corporation.
*
* SPDX-License-Identifier: Apache-2.0
*
* Licensed under the Apache License, Version 2.0 (the "License");
* you may not use this file except in compliance with the License.
* You may obtain a copy of the License at
*
*     http://www.apache.org/licenses/LICENSE-2.0
*
* Unless required by applicable law or agreed to in writing, software
* distributed under the License is distributed on an "AS IS" BASIS,
* WITHOUT WARRANTIES OR CONDITIONS OF ANY KIND, either express or implied.
* See the License for the specific language governing permissions and
* limitations under the License.
*******************************************************************************/

#ifndef _CYIP_MXS40ADCMIC_H_
#define _CYIP_MXS40ADCMIC_H_

#include "cyip_headers.h"

/*******************************************************************************
*                                 MXS40ADCMIC
*******************************************************************************/

#define MXS40ADCMIC_SECTION_SIZE                0x00010000UL

/**
  * \brief ADC (MXS40ADCMIC)
  */
typedef struct {
  __IOM uint32_t ADCMIC_CTRL;                   /*!< 0x00000000 Control the operation of the ADCMIC block including clock
                                                                generation,clock selection and pdm data latching */
  __IOM uint32_t ADCMIC_PAD_CTRL;               /*!< 0x00000004 Control the pads in the ADCMIC block */
  __IOM uint32_t ADCMIC_FIFO_CTRL;              /*!< 0x00000008 Controls the operation of the fifo */
  __IOM uint32_t ADCMIC_LFSR_CTRL;              /*!< 0x0000000C Controls the operation of the LFSR */
   __IM uint32_t ADCMIC_TRIGGER;                /*!< 0x00000010 Register to control Trigger */
  __IOM uint32_t ADCMIC_TRIGGER_CLR;            /*!< 0x00000014 Register to clear Trigger */
  __IOM uint32_t ADCMIC_TRIGGER_SET;            /*!< 0x00000018 Register to set Trigger */
  __IOM uint32_t ADCMIC_TRIGGER_MASK;           /*!< 0x0000001C Register to mask Trigger */
  __IOM uint32_t ADCMIC_INTR;                   /*!< 0x00000020 Register to cause Interrupt */
  __IOM uint32_t ADCMIC_INTR_SET;               /*!< 0x00000024 Register to set Interrupt */
  __IOM uint32_t ADCMIC_INTR_MASK;              /*!< 0x00000028 Register to mask Interrupt */
   __IM uint32_t ADCMIC_INTR_MASKED;            /*!< 0x0000002C Register to and intr_mask Intr to crreate the interrupt */
  __IOM uint32_t ADCMIC_TRIG_INTRPT_TIMER_CTRL; /*!< 0x00000030 Controls the timer for the generation of triggers and
                                                                interrupts for dc measurement in the block */
  __IOM uint32_t ADCMIC_TP;                     /*!< 0x00000034 Data used for DFT test for setting and observing test points */
   __IM uint32_t RESERVED[2];
   __IM uint32_t ADCMIC_DATA;                   /*!< 0x00000040 N/A */
   __IM uint32_t RESERVED1[47];
  __IOM uint32_t ADC_CLK_CTRL;                  /*!< 0x00000100 Control the clocks in the ADC block */
  __IOM uint32_t ADC_GPIO_CTRL;                 /*!< 0x00000104 GPIO control for ADC */
  __IOM uint32_t ADC_PD_CTRL;                   /*!< 0x00000108 Control the  power down controls in the ADC block. */
  __IOM uint32_t ADC_BG_REF_CTRL;               /*!< 0x0000010C Control the Band Gap and Reference Voltages of the ADC */
  __IOM uint32_t ADC_CORE_CTRL;                 /*!< 0x00000110 Control the clocks in the ADC block */
  __IOM uint32_t ADC_MIC_BIAS_PGA_CTRL;         /*!< 0x00000114 Control the BIAS and PGA of ADC block */
  __IOM uint32_t ADC_SPARE;                     /*!< 0x00000118 Spare registers in the ADC block */
   __IM uint32_t RESERVED2[57];
  __IOM uint32_t AUXADC_CTRL;                   /*!< 0x00000200 Register to control AuxAdcDecim operation */
  __IOM uint32_t AUXADC_CIC_CTRL;               /*!< 0x00000204 Register to control CIC operation in AuxAdcDecim block */
  __IOM uint32_t AUXADC_OVERRIDE;               /*!< 0x00000208 Register that holds the override values for AuxAdcDecim block */
  __IOM uint32_t AUXADC_DF3_COEFF;              /*!< 0x0000020C Register that controls the RAM operation for writing DF3
                                                                Coefficients into the RAM */
  __IOM uint32_t AUXADC_BIQUAD0_COEFF_0;        /*!< 0x00000210 Register holding the coefficients for BIQUAD0 operation. */
  __IOM uint32_t AUXADC_BIQUAD0_COEFF_1;        /*!< 0x00000214 Register holding the coefficients for BIQUAD0 operation. */
  __IOM uint32_t AUXADC_BIQUAD0_COEFF_2;        /*!< 0x00000218 Register holding the coefficients for BIQUAD0 operation. */
  __IOM uint32_t AUXADC_BIQUAD1_COEFF_0;        /*!< 0x0000021C Register holding the coefficients for BIQUAD1 operation. */
  __IOM uint32_t AUXADC_BIQUAD1_COEFF_1;        /*!< 0x00000220 Register holding the coefficients for BIQUAD1 operation. */
  __IOM uint32_t AUXADC_BIQUAD1_COEFF_2;        /*!< 0x00000224 Register holding the coefficients for BIQUAD1 operation. */
  __IOM uint32_t AUXADC_BIQUAD2_COEFF_0;        /*!< 0x00000228 Register holding the coefficients for BIQUAD2 operation. */
  __IOM uint32_t AUXADC_BIQUAD2_COEFF_1;        /*!< 0x0000022C Register holding the coefficients for BIQUAD2 operation. */
  __IOM uint32_t AUXADC_BIQUAD2_COEFF_2;        /*!< 0x00000230 Register holding the coefficients for BIQUAD2 operation. */
  __IOM uint32_t AUXADC_BIQUAD3_COEFF_0;        /*!< 0x00000234 Register holding the coefficients for BIQUAD3 operation. */
  __IOM uint32_t AUXADC_BIQUAD3_COEFF_1;        /*!< 0x00000238 Register holding the coefficients for BIQUAD3 operation. */
  __IOM uint32_t AUXADC_BIQUAD3_COEFF_2;        /*!< 0x0000023C Register holding the coefficients for BIQUAD3 operation. */
  __IOM uint32_t AUXADC_BIQUAD4_COEFF_0;        /*!< 0x00000240 Register holding the coefficients for BIQUAD4 operation. */
  __IOM uint32_t AUXADC_BIQUAD4_COEFF_1;        /*!< 0x00000244 Register holding the coefficients for BIQUAD4 operation. */
  __IOM uint32_t AUXADC_BIQUAD4_COEFF_2;        /*!< 0x00000248 Register holding the coefficients for BIQUAD4 operation. */
   __IM uint32_t RESERVED3;
  __IOM uint32_t AUXADC_CIC_STATUS;             /*!< 0x00000250 Status of the CIC in AuxAdcDecim block */
   __IM uint32_t AUXADC_DF1_STATUS;             /*!< 0x00000254 Status of the DF1 FIR Filter in AuxAdcDecim block */
   __IM uint32_t AUXADC_DF2_STATUS;             /*!< 0x00000258 Status of the DF2 FIR Filter in AuxAdcDecim block */
   __IM uint32_t AUXADC_DF3_STATUS;             /*!< 0x0000025C Status of the DF3 FIR Filter in AuxAdcDecim block */
   __IM uint32_t AUXADC_BIQUAD_STATUS;          /*!< 0x00000260 Status of the BIQUAD IIR  Filter in AuxAdcDecim block */
} MXS40ADCMIC_Type;                             /*!< Size = 612 (0x264) */


